In [1]:
import pandas as pd

In [ ]:
csv ---> comma separated values

In [3]:
df = pd.read_csv('test.csv')  # csv file ipynb same dir

In [4]:
df

  name  age      sal
0  xyz   26     7555
1  pqr   97   161616
2  abc   26  1641964

In [5]:
type(df)

pandas.core.frame.DataFrame

In [7]:
type(df['name'])

pandas.core.series.Series

In [ ]:
Series|Series|

In [8]:
df1 = pd.read_csv(r"C:\Users\kanti\OneDrive\Pictures\test.csv")

In [9]:
df1

  name  age      sal
0  xyz   26     7555
1  pqr   97   161616
2  abc   26  1641964

In [16]:
df2 = pd.read_excel('test.xlsx',sheet_name='copper')

In [17]:
df2

  cooper type  price
0         sdf   5467
1         sdf  56765
2         sdf    756
3       sdfgh    765
4         dfh    756
5        dsfg    756
6       sdfgh      7

In [18]:
df2['test'] = 450

In [21]:
df2.to_excel('test123.xlsx')

In [24]:
df2.to_html('test.html')

In [25]:
df2.to_json()

'{"cooper type":{"0":"sdf","1":"sdf","2":"sdf","3":"sdfgh","4":"dfh","5":"dsfg","6":"sdfgh"},"price":{"0":5467,"1":56765,"2":756,"3":765,"4":756,"5":756,"6":7},"test":{"0":450,"1":450,"2":450,"3":450,"4":450,"5":450,"6":450}}'

In [28]:
type(df2.to_numpy())

numpy.ndarray

In [ ]:
csv and excel data read

In [38]:
df4 = pd.read_html('https://en.wikipedia.org/wiki/COVID-19_pandemic_by_country_and_territory')

In [39]:
type(df4)

list

In [40]:
df4[12]

,Unnamed: 0,Country,Deaths / million,Deaths,Cases
0,NaN,World[a],830,6568987,625133548
1,NaN,Peru,6432,216877,4150737
2,NaN,Bulgaria,5488,37795,1271228
3,NaN,Bosnia and Herzegovina,4940,16160,399499
4,NaN,Hungary,4910,47680,2120543
...,...,...,...,...,...
216,NaN,Falkland Islands,—,—,1930
217,NaN,Vatican City,—,0,29
218,NaN,"Saint Helena, Ascension and Tristan da Cunha",—,—,2007
219,NaN,Tuvalu,—,—,20
220,.mw-parser-output .reflist{font-size:90%;margi...,.mw-parser-output .reflist{font-size:90%;margi...,.mw-parser-output .reflist{font-size:90%;margi...,.mw-parser-output .reflist{font-size:90%;margi...,.mw-parser-output .reflist{font-size:90%;margi...

In [46]:
py_dict = {
    'name': ['a','b','c',None],
    'id':[54,75,35,75],
    'age':[43,54,24,64]
}

In [47]:
df5 = pd.DataFrame(py_dict)

In [48]:
df5

   name  id  age
0     a  54   43
1     b  75   54
2     c  35   24
3  None  75   64

In [49]:
#list of tuple --> dataframe

In [50]:

p = [(1,2,3,4,5),
    (24234,46,546,354,57,46),
    ('fsdf','safsdf','asfsd','asdfsd','fdsf')]

In [51]:
p

[(1, 2, 3, 4, 5),
 (24234, 46, 546, 354, 57, 46),
 ('fsdf', 'safsdf', 'asfsd', 'asdfsd', 'fdsf')]

In [59]:
df6 = pd.DataFrame(p,columns=['a','b','c','d','e','f'])

In [60]:
df6

       a       b      c       d     e     f
0      1       2      3       4     5   NaN
1  24234      46    546     354    57  46.0
2   fsdf  safsdf  asfsd  asdfsd  fdsf   NaN

In [62]:
read operation -->

    name  age
id
54     a   43
75     b   54
35     c   24
75  None   64

In [ ]:
df6 = pd.read_json('https://api.sampleapis.com/coffee/iced')

In [ ]:
django - api -- consume --->